import 'dart:convert';
/// categories : [{"id":"607d6bdcb1bc9f0019489d32","name":"Apple","slug":"apple","active":true,"description":"<p>Testing it</p>","order":"1","children":[{"id":"6020fe60c988660019adfa22","name":"Mac","slug":"macbook","active":true,"description":"<p>Интернет-магазин MacBro предлагает купить ноутбуки MacBook в Ташкенте. Компания специализируется на поставках этой электроники уже более 12 лет. Мы являемся дистрибьютором Apple в Узбекистане, что позволяет обеспечить оптимальные условия продажи популярных ноутбуков от ведущего американского производителя. Ознакомьтесь с информацией о продукции, представленной в этой рубрике каталога, и преимуществами продажи лэптопов Макбук в Узбекистане в интернет-магазине MacBro. Также в обзоре даны ответы на часто задаваемые вопросы покупателей.</p>","order":"1","image":"https://cdn.macbro.uz/macbro/e6e0bf9d-37ee-4d9b-8c7f-32a48a236672","children":null,"created_at":"Mon Feb 08 2021 09:03:28 GMT+0000 (Coordinated Universal Time)","updated_at":"Mon Feb 08 2021 09:03:28 GMT+0000 (Coordinated Universal Time)"},{"id":"6020feadc988660019adfa25","name":"AirPods","slug":"airpods","active":true,"description":"<p>Интернет-магазин MacBro предлагает на выгодных для вас условиях купить наушники AirPods в Ташкенте. Компания уже более 12 лет специализируется на поставках мобильных гаджетов. При этом мы являемся дистрибьютором Apple в Узбекистане, что позволяет обеспечить оптимальные условия продажи лучших беспроводных наушников Аирподс в Узбекистане. Ознакомьтесь с информацией о продукции, представленной в этой рубрике нашего каталога, и преимуществами продажи Bluetooth-наушников Apple в онлайн-магазине MacBro. Также в обзоре даны ответы на часто задаваемые вопросы покупателей.</p>","order":"5","image":"https://cdn.macbro.uz/macbro/ccc67903-fb46-49bf-88d9-541979b073f7","children":null,"created_at":"Mon Feb 08 2021 09:04:45 GMT+0000 (Coordinated Universal Time)","updated_at":"Mon Feb 08 2021 09:04:45 GMT+0000 (Coordinated Universal Time)"},{"id":"6020fec7c988660019adfa28","name":"Watch","slug":"apple-watch","active":true,"description":"<p>Интернет-магазин MacBro предлагает заказать Apple Watch в Ташкенте. Компания давно специализируется на поставках этих набирающих популярность гаджетов. Мы являемся дистрибьютором Apple в Узбекистане, что позволяет обеспечить оптимальные условия продажи популярных смарт-часов от ведущего американского производителя. Ознакомьтесь с информацией о продукции, представленной в этой рубрике каталога, и преимуществами продажи умных часов Apple Watch в Узбекистане в интернет-магазине MacBro. Также в обзоре даны ответы на часто задаваемые вопросы покупателей.</p>","order":"4","image":"https://cdn.macbro.uz/macbro/fc194078-c2c4-4681-9879-a0f307ddfc91","children":null,"created_at":"Mon Feb 08 2021 09:05:11 GMT+0000 (Coordinated Universal Time)","updated_at":"Mon Feb 08 2021 09:05:11 GMT+0000 (Coordinated Universal Time)"},{"id":"6021089dc988660019adfa31","name":"iPhone","slug":"iphone","active":true,"description":"<p>Интернет-магазин MacBro предлагает купить iPhone в Ташкенте. Компания давно специализируется на поставках смартфонов от ведущего американского производителя. Мы являемся дистрибьютором Apple в Узбекистане, что позволяет обеспечить оптимальные условия продажи самой популярной марки телефонов. Ознакомьтесь с информацией о продукции, представленной в этой рубрике каталога, и преимуществами продажи Айфонов в Узбекистане в интернет-магазине MacBro. Также в обзоре даны ответы на часто задаваемые вопросы покупателей.</p>","order":"2","image":"https://cdn.macbro.uz/macbro/810d02c7-2265-4e27-9086-07cdc4ae1837","children":null,"created_at":"Mon Feb 08 2021 09:47:09 GMT+0000 (Coordinated Universal Time)","updated_at":"Mon Feb 08 2021 09:47:09 GMT+0000 (Coordinated Universal Time)"},{"id":"6039f8177aeef500184216b2","name":"iPad","slug":"ipad","active":true,"description":"<p>Интернет-магазин MacBro представляет категорию планшетов iPad в Ташкенте. Компания уже более 12 лет специализируется на поставках мобильных гаджетов от ведущего американского производителя. Мы являемся дистрибьютором Apple в Узбекистане, что позволяет обеспечить оптимальные условия продажи лучших моделей популярного планшета. Ознакомьтесь с информацией о продукции, представленной в этой рубрике каталога, и преимуществами продажи iPad Apple в Узбекистане в интернет-магазине MacBro. Также в обзоре даны ответы на часто задаваемые вопросы покупателей.</p>","order":"3","image":"https://cdn.macbro.uz/macbro/c351bd12-eeff-4df5-843b-74a429551136","children":null,"created_at":"Sat Feb 27 2021 07:43:19 GMT+0000 (Coordinated Universal Time)","updated_at":"Sat Feb 27 2021 07:43:19 GMT+0000 (Coordinated Universal Time)"}],"image":"https://cdn.macbro.uz/macbro/3045dc67-9604-4308-b1ba-70a09dc3519a","wide":true},{"id":"6013d90045301e00198740d8","name":"Акустика","slug":"akustika","active":true,"description":"<p>Интернет-магазин MacBro предлагает купить портативную акустику в Ташкенте. Мы уже несколько лет специализируемся на поставках такой продукции от ведущих брендов. JBL колонки, наушники и другая аудиотехника от известных производителей пользуются повышенным спросом среди наших покупателей. Безупречное качество и разнообразный выбор такой продукции сочетаются с оптимальными условиями продажи, включающими минимальные по Узбекистану цены на акустические устройства и приспособления из нашего каталога.</p>","order":"2","children":[{"id":"611e588513bc0f001aef64d9","name":"HomePod","slug":"homepod-3dpldqksiy05uf","active":true,"description":"<p>Интернет-магазин MacBro предлагает купить Apple HomePod в Ташкенте. Компания не первый год специализируется на поставках гаджетов от ведущего американского производителя. Мы являемся дистрибьютором Apple в Узбекистане, что позволяет обеспечить оптимальные условия продажи популярных беспроводных колонок HomePod. Ознакомьтесь с общей информацией о продукции, представленной в этой рубрике каталога, и преимуществами нашего предложения приобрести Хом Под в интернет-магазине MacBro.</p>","order":"1","image":"https://cdn.macbro.uz/macbro/5812a727-4861-4435-91f5-e6d5c2591086","children":null,"created_at":"Thu Aug 19 2021 13:11:33 GMT+0000 (Coordinated Universal Time)","updated_at":"Thu Aug 19 2021 13:11:33 GMT+0000 (Coordinated Universal Time)"},{"id":"611e590c13bc0f001aef64dc","name":"JBL","slug":"jbl-3dpldqksiy32je","active":true,"description":"<p>Интернет-магазин MacBro предлагает купить колонки JBL в Ташкенте. Мы не первый год специализируемся на поставках таких гаджетов от известного американского производителя &mdash; дочерней компании Samsung Electronics. Покупателям обеспечены оптимальные условия продажи, включая минимальные для Узбекистана цены на колонки и динамики ЖБЛ. Ознакомьтесь с общей информацией о продукции, представленной в этой рубрике нашего каталога, и преимуществами предложения покупки продукции JBL в интернет-магазине MacBro.</p>","order":"3","image":"https://cdn.macbro.uz/macbro/634f4ed4-7842-4fd5-9815-7afa2588680a","children":null,"created_at":"Thu Aug 19 2021 13:13:48 GMT+0000 (Coordinated Universal Time)","updated_at":"Thu Aug 19 2021 13:13:48 GMT+0000 (Coordinated Universal Time)"},{"id":"611e598813bc0f001aef64e2","name":"Harman Kardon","slug":"harmon-kardon-3dpldqksiy5prr","active":true,"description":"<p>Интернет-магазин MacBro предлагает заказать акустику Harman Kardon в Ташкенте. Мы тесно сотрудничаем с известным американским производителем и уже не первый год специализируемся на поставках его продукции. На сайте созданы оптимальные условия продажи, включая минимальные по Узбекистану цены на портативные колонки Харман Кардон. Ознакомьтесь с преимуществами предложения приобрести акустику от ведущего бренда в интернет-магазине MacBro. Здесь же вы найдете ответы на часто задаваемые вопросы покупателей.</p>","order":"5","image":"https://cdn.macbro.uz/macbro/b4851fae-aaf4-4935-a715-9d717c3fb135","children":null,"created_at":"Thu Aug 19 2021 13:15:52 GMT+0000 (Coordinated Universal Time)","updated_at":"Thu Aug 19 2021 13:15:52 GMT+0000 (Coordinated Universal Time)"},{"id":"617791cb78551d00197fa8f6","name":"Marshall","slug":"marshall-pglydpkv7ndih2","active":true,"description":"<p>Интернет-магазин MacBro представляет акустику Marshall в Ташкенте и других городах Узбекистана. Продажа акустических систем, колонок и наушников от известного британского бренда &mdash; востребованное направление нашей деятельности. Мы реализуем лучшие товары от Маршал, предлагая покупателям оптимальные условия продажи. Безупречное качество продукции сочетается с минимальными для Ташкента ценами на акустику Marshall, быструю доставку товара и другими преимуществами нашего сервиса.</p>","order":"6","image":"https://cdn.macbro.uz/macbro/e4c853fe-e82c-41dc-900f-ef940a81c044","children":null,"created_at":"Tue Oct 26 2021 05:27:39 GMT+0000 (Coordinated Universal Time)","updated_at":"Tue Oct 26 2021 05:27:39 GMT+0000 (Coordinated Universal Time)"},{"id":"6188eb900d8c940017b88577","name":"Nillkin","slug":"nillkin-1ld77ankvqgdcw8","active":true,"description":"<p>Предложение заказать аксессуары Nillkin в Ташкенте в интернет-магазине MacBro &mdash; выгодный во всех отношениях выбор для покупателей. Мы не первый год сотрудничаем с известной китайской компанией, что позволило создать оптимальные условия продажи ее продукции. Гарантированное качество от производителя, быстрая доставка, покупка в рассрочку &mdash; все это дополняют доступные для Узбекистана цены на продукцию Ниллкин, а также акции, позволяющие клиентам сокращать затраты.</p>","order":"6","image":"https://cdn.macbro.uz/macbro/6d82d572-fa12-4db5-853a-115b916537f5","children":null,"created_at":"Mon Nov 08 2021 09:19:12 GMT+0000 (Coordinated Universal Time)","updated_at":"Mon Nov 08 2021 09:19:12 GMT+0000 (Coordinated Universal Time)"},{"id":"6188f39b0d8c940017b8884f","name":"2E","slug":"2e-1ld77ankvqhlhuc","active":true,"description":"<p>MacBro представляет акустику 2E (TWOE) в Узбекистане. Продажа портативных колонок, динамиков и наушников от набирающего популярность международного бренда &mdash; одно из новых направлений нашей деятельности. В нашем каталоге представлена лучшая продукция 2Е, а покупателям предлагаются оптимальные условия продажи. Гарантированное качество от производителя сочетается с минимальными для Ташкента ценами на акустические системы и наушники 2Е. Все это дополняет быстрая доставка, беспроцентная рассрочка и другие преимущества нашего сервиса.</p>","order":"9","image":"https://cdn.macbro.uz/macbro/65b1fac2-06c0-4f04-86cd-b669c232b440","children":null,"created_at":"Mon Nov 08 2021 09:53:31 GMT+0000 (Coordinated Universal Time)","updated_at":"Mon Nov 08 2021 09:53:31 GMT+0000 (Coordinated Universal Time)"},{"id":"623c496b4334fa001a26a423","name":"Yandex","slug":"yandex-pbac1ql14uz7b1","active":true,"description":"<p>Ищете где выгодно купить Яндекс колонки в Ташкенте? Желаете пользоваться разными популярными сервисами на одном акустическом устройстве? Хотите заказать умную колонку Алиса с доставкой по Узбекистану? Интернет-магазин MacBro &mdash; лучший выбор для решения этих и подобных им задач. Мы предлагаем самые привлекательные условия продажи смарт-колонок Яндекс. Гарантированное качество от известного бренда сочетается с другими преимуществами. Среди них услуга рассрочки, доставка, разные способы оплаты, профессиональные консультации. Все это дополняют минимальная для Узбекистана цена колонок Алиса.</p>","order":"8","image":"https://cdn.macbro.uz/macbro/1f693a8a-48d6-4d6a-b78a-9ee9f0b9f15d","children":null,"created_at":"Thu Mar 24 2022 10:35:23 GMT+0000 (Coordinated Universal Time)","updated_at":"Thu Mar 24 2022 10:35:23 GMT+0000 (Coordinated Universal Time)"}],"image":"https://cdn.macbro.uz/macbro/cdab9cac-ea07-4808-8263-335647eb7c9e","wide":false},{"id":"6013d90e45301e00198740db","name":"Аксессуары","slug":"aksessuary","active":true,"description":"<p>Интернет-магазин MacBro предлагает купить аксессуары для смартфонов в Ташкенте. Мы не первый год специализируемся на поставках такой продукции от ведущих брендов. Клавиатуры, наушники, чехлы и другие аксессуары от известных производителей пользуются повышенным спросом среди наших покупателей. Безупречное качество и разнообразный выбор продукции сочетаются с оптимальными условиями продажи, включающими минимальные по Узбекистану цены на аксессуары для мобильных телефонов и других гаджетов.</p>","order":"4","children":[{"id":"60210968c988660019adfa37","name":"Чехлы и стекла","slug":"chekhly","active":true,"description":"<p>Интернет-магазин MacBro предлагает заказать чехлы для Айфонов в Ташкенте. Компания не первый год специализируется на поставках аксессуаров для популярных смартфонов. Мы являемся дистрибьютором Apple в Узбекистане, что позволяет обеспечить оптимальные условия продажи чехлов от ведущего американского производителя мобильных гаджетов. Ознакомьтесь с информацией о продукции, представленной в этой рубрике каталога, и преимуществами продажи чехлов для Apple iPhone в Узбекистане в интернет-магазине MacBro. Также в обзоре даны ответы на часто задаваемые вопросы покупателей.</p>","order":"0","image":"https://cdn.macbro.uz/macbro/a45d049f-57d7-4bff-8948-1d5d0d41a386","children":null,"created_at":"Mon Feb 08 2021 09:50:32 GMT+0000 (Coordinated Universal Time)","updated_at":"Mon Feb 08 2021 09:50:32 GMT+0000 (Coordinated Universal Time)"},{"id":"6021098cc988660019adfa3a","name":"Зарядчики","slug":"zaryadchiki","active":true,"description":"<p>Интернет-магазин MacBro предлагает купить зарядки для iPhone в Ташкенте. Компания специализируется на поставках этой продукции уже более 12 лет. Мы являемся дистрибьютором Apple в Узбекистане, что позволяет обеспечить оптимальные условия продажи зарядных устройств для смартфонов от ведущего производителя планеты. Ознакомьтесь с информацией о продукции, представленной в этой рубрике каталога, и преимуществами продажи телефонных зарядчиков в Узбекистане в интернет-магазине MacBro. Также в обзоре даны ответы на часто задаваемые вопросы покупателей.</p>","order":"0","image":"https://cdn.macbro.uz/macbro/5eb7439c-e353-46ad-92c3-29926f5d85af","children":null,"created_at":"Mon Feb 08 2021 09:51:08 GMT+0000 (Coordinated Universal Time)","updated_at":"Mon Feb 08 2021 09:51:08 GMT+0000 (Coordinated Universal Time)"},{"id":"60fbd0c5493af6001bdafb57","name":"Прочие аксессуары","slug":"prochie-aksessuary","active":true,"description":"","order":"3","image":"https://cdn.macbro.uz/macbro/6b1ef09a-d67b-4072-922d-f7d1e1a8ae0d","children":null,"created_at":"Sat Jul 24 2021 08:35:17 GMT+0000 (Coordinated Universal Time)","updated_at":"Sat Jul 24 2021 08:35:17 GMT+0000 (Coordinated Universal Time)"},{"id":"612c74134a4547001a2a346e","name":"Аксессуары Apple","slug":"aksessuary-apple-di7hw7qksy8gnwr","active":true,"description":"<p>Интернет-магазин MacBro предлагает купить аксессуары Apple в Ташкенте. Мы давно специализируемся на поставках продукции от одного из лидеров мировой индустрии цифровых технологий. Клавиатуры Apple, наушники, мышки и другие аксессуары от известного производителя пользуются повышенным спросом среди наших покупателей. Безупречное качество продукции сочетается с оптимальными условиями продажи, включающими минимальные по Узбекистану цены на аксессуары для iPhone и других цифровых устройств этой компании.</p>","order":"4","image":"https://cdn.macbro.uz/macbro/c90e40ab-c68f-4ccc-89ea-c7c0bed9fe60","children":null,"created_at":"Mon Aug 30 2021 06:00:51 GMT+0000 (Coordinated Universal Time)","updated_at":"Mon Aug 30 2021 06:00:51 GMT+0000 (Coordinated Universal Time)"},{"id":"614b6893556ce1001ca6ea3d","name":"Сумки для Ноутбуков","slug":"sumki-dlya-noutbukov-4x5bb1sktvsa5gf","active":true,"description":"<p>Интернет-магазин MacBro представляет коллекцию лучших сумок для ноутбуков в Ташкенте. Мы давно специализируемся на продаже такой продукции от ведущих производителей планеты. Предлагаемые сумки для ноутбуков пользуются высоким спросом среди наших покупателей. Безупречное качество и разнообразный выбор представленной в этом разделе каталога продукции сочетаются с оптимальными условиями продажи, включающими минимальные по Узбекистану цены на сумки для ноутбуков и оперативную доставку по всей территории страны.</p>","order":"5","image":"https://cdn.macbro.uz/macbro/bdfc7746-6549-4e55-b6b8-7efdaa3aac96","children":null,"created_at":"Wed Sep 22 2021 17:32:03 GMT+0000 (Coordinated Universal Time)","updated_at":"Wed Sep 22 2021 17:32:03 GMT+0000 (Coordinated Universal Time)"},{"id":"615594e4832cb1001bb80851","name":"Ремешки Watch","slug":"remeshki-watch-1fg3y3rku6t7xzn","active":true,"description":"<p>Интернет-магазин MacBro предлагает заказать ремешки для Apple Watch в Узбекистане. Продажа этих аксессуаров от ведущего бренда мобильных гаджетов &mdash; одно из востребованных направлений нашей деятельности. В каталоге компании представлены лучшие модели ремней для часов Эпл, а покупателям предлагаются оптимальные условия продажи. Гарантированное качество от производителя сочетается с минимальными для Ташкента ценами на браслеты для Apple Watch. Все это дополняет быстрая доставка, беспроцентная рассрочка и другие преимущества нашего сервиса.</p>","order":"7","image":"https://cdn.macbro.uz/macbro/eececf7d-5811-4dc4-97ee-1f4a46c269d6","children":null,"created_at":"Thu Sep 30 2021 10:43:48 GMT+0000 (Coordinated Universal Time)","updated_at":"Thu Sep 30 2021 10:43:48 GMT+0000 (Coordinated Universal Time)"}],"image":"https://cdn.macbro.uz/macbro/ab6a9255-cd45-4467-8f66-8cce21204a37","wide":false},{"id":"6013d8b345301e00198740cf","name":"Samsung","slug":"produkty-samsung","active":true,"description":"<p>Интернет-магазин MacBro представляет лучшие телефоны и гаджеты Samsung в Ташкенте. Мы давно специализируемся на поставках продукции от одного из лидеров мировой индустрии цифровых технологий. На сайте для покупателей созданы оптимальные условия продажи, включая минимальные по Узбекистану цены телефонов Самсунг и других товаров компании. Ознакомьтесь с ассортиментом, представленным в этой рубрике нашего каталога, и преимуществами предложения приобрести лучшую продукцию Samsung в интернет-магазине MacBro.</p>","order":"9","children":[{"id":"6039f9617aeef500184216be","name":"Galaxy Buds","slug":"galaxy-bud","active":true,"description":"<p>Интернет-магазин MacBro предлагает заказать наушники Samsung Galaxy Buds в Ташкенте. Мы уже несколько лет специализируемся на поставках этих гаджетов, представленных одним из лидеров мировой индустрии цифровых технологий. На сайте созданы оптимальные условия продажи, включая минимальные по Узбекистану цены на беспроводные наушники Самсунг и другие товары компании. Ознакомьтесь с преимуществами предложения приобрести Samsung Galaxy Buds в интернет-магазине MacBro. Здесь же вы найдете ответы на часто задаваемые вопросы покупателей.</p>","order":"4","image":"https://cdn.macbro.uz/macbro/50a9410d-e3d0-405a-92bc-8079ae7b23e2","children":null,"created_at":"Sat Feb 27 2021 07:48:49 GMT+0000 (Coordinated Universal Time)","updated_at":"Sat Feb 27 2021 07:48:49 GMT+0000 (Coordinated Universal Time)"},{"id":"603a04787aeef500184216c4","name":"Galaxy Watch","slug":"galaxy-watch","active":true,"description":"<p>Интернет-магазин MacBro предлагает заказать умные часы Samsung в Ташкенте. Мы специализируемся на поставках этих гаджетов с момента их появления. На сайте созданы оптимальные условия продажи, включая минимальные по Узбекистану цены на смарт-часы Самсунг и другие товары компании. Ознакомьтесь с преимуществами предложения приобрести Samsung Galaxy Watch в интернет-магазине MacBro. Здесь же вы найдете ответы на часто задаваемые вопросы покупателей.</p>","order":"5","image":"https://cdn.macbro.uz/macbro/03149a6f-49ac-4ad0-918d-8c3e4cb70f21","children":null,"created_at":"Sat Feb 27 2021 08:36:08 GMT+0000 (Coordinated Universal Time)","updated_at":"Sat Feb 27 2021 08:36:08 GMT+0000 (Coordinated Universal Time)"},{"id":"6062dbe6d67d43001a6116e9","name":"Galaxy Series S","slug":"galaxy-series-s","active":true,"description":"<p>Интернет-магазин MacBro предлагает купить смартфоны Samsung Galaxy S в Ташкенте. Мы не первый год специализируемся на поставках лучших моделей от одного из лидеров мировой индустрии цифровых технологий. На сайте созданы оптимальные условия продажи, включая минимальные по Узбекистану цены телефонов Самсунг Галакси С и других товаров компании. Ознакомьтесь с преимуществами предложения приобрести Samsung Galaxy S в интернет-магазине MacBro. Здесь же вы найдете ответы на часто задаваемые вопросы покупателей.</p>","order":"1","image":"https://cdn.macbro.uz/macbro/610ee12c-ce8c-4ca2-a102-234bebab98f5","children":null,"created_at":"Tue Mar 30 2021 08:05:58 GMT+0000 (Coordinated Universal Time)","updated_at":"Tue Mar 30 2021 08:05:58 GMT+0000 (Coordinated Universal Time)"},{"id":"6062e5a8d67d43001a6116ef","name":"Galaxy Series A","slug":"galaxy-series-a","active":true,"description":"<p>Интернет-магазин MacBro предлагает купить смартфоны Samsung Galaxy A в Ташкенте. Мы давно специализируемся на поставках лучших моделей от одного из лидеров мировой индустрии цифровых технологий. На сайте созданы оптимальные условия продажи, включая минимальные по Узбекистану цены телефонов Самсунг Галакси А и других товаров компании. Ознакомьтесь с преимуществами предложения приобрести Samsung Galaxy A в интернет-магазине MacBro. Здесь же вы найдете ответы на часто задаваемые вопросы покупателей.</p>","order":"2","image":"https://cdn.macbro.uz/macbro/009811b0-d2aa-4233-96b8-a02127faa544","children":null,"created_at":"Tue Mar 30 2021 08:47:36 GMT+0000 (Coordinated Universal Time)","updated_at":"Tue Mar 30 2021 08:47:36 GMT+0000 (Coordinated Universal Time)"},{"id":"6062e5bad67d43001a6116f2","name":"Galaxy Series M","slug":"galaxy-series-m","active":true,"description":"<p>Интернет-магазин MacBro предлагает купить смартфоны Samsung Galaxy M в Ташкенте. Мы не первый год специализируемся на поставках лучших моделей этой и других серий, представленных одним из лидеров мировой индустрии цифровых технологий. На сайте созданы оптимальные условия продажи, включая минимальные по Узбекистану цены телефонов Самсунг Галакси М и других товаров компании. Ознакомьтесь с преимуществами предложения приобрести Samsung Galaxy M в интернет-магазине MacBro. Здесь же вы найдете ответы на часто задаваемые вопросы покупателей.</p>","order":"3","image":"https://cdn.macbro.uz/macbro/56f7a258-dc99-418b-a96d-c4b76071e364","children":null,"created_at":"Tue Mar 30 2021 08:47:54 GMT+0000 (Coordinated Universal Time)","updated_at":"Tue Mar 30 2021 08:47:54 GMT+0000 (Coordinated Universal Time)"},{"id":"6062e5cbd67d43001a6116f5","name":"Galaxy Series Note","slug":"galaxy-series-note","active":true,"description":"<p>Интернет-магазин MacBro предлагает купить смартфоны Samsung Galaxy Note в Ташкенте. Мы не первый год специализируемся на поставках продукции от одного из лидеров мировой индустрии цифровых технологий. На сайте созданы оптимальные условия продажи, включая минимальные по Узбекистану цены телефонов Самсунг Галакси Ноут и других товаров компании. Ознакомьтесь с преимуществами предложения приобрести Samsung Galaxy Note в интернет-магазине MacBro. Здесь же вы найдете ответы на часто задаваемые вопросы покупателей.</p>","order":"0","image":"https://cdn.macbro.uz/macbro/4b06f2c8-140e-4a3c-a526-c623f00c7ea3","children":null,"created_at":"Tue Mar 30 2021 08:48:11 GMT+0000 (Coordinated Universal Time)","updated_at":"Tue Mar 30 2021 08:48:11 GMT+0000 (Coordinated Universal Time)"},{"id":"613210c6bb15a6001b82bb5b","name":"Gusto","slug":"samsung-gusto-di7hw7rkt4bfrtp","active":true,"description":"<p>Интернет-магазин MacBro предлагает купить мобильные телефоны Samsung Gusto в Ташкенте. Мы не первый год специализируемся на поставках продукции от одного из лидеров мировой индустрии цифровых технологий. Линейка кнопочных телефонов с поддержкой технологии CDMA пользуется повышенным спросом среди наших покупателей. Безупречное качество телефонов сочетается с оптимальными условиями продажи, включающими минимальные по Узбекистану цены на телефоны Samsung Gusto и другие товары компании.</p>","order":"10","image":"https://cdn.macbro.uz/macbro/84ab5b47-0507-4c60-9079-74e2913759de","children":null,"created_at":"Fri Sep 03 2021 12:10:46 GMT+0000 (Coordinated Universal Time)","updated_at":"Fri Sep 03 2021 12:10:46 GMT+0000 (Coordinated Universal Time)"},{"id":"613222ccbb15a6001b82bbb2","name":"Galaxy Series Z","slug":"galaxy-series-z-di7hw7rkt4e6o89","active":true,"description":"<p>Интернет-магазин MacBro предлагает купить смартфоны Samsung Galaxy Z в Ташкенте. Мы не первый год специализируемся на поставках продукции от одного из лидеров мировой индустрии цифровых технологий. Линейка гибких смартфонов пользуется повышенным спросом среди наших покупателей. Безупречное качество телефонов сочетается с оптимальными условиями продажи, включающими минимальные по Узбекистану цены телефонов Самсунг Галакси Z и других товаров компании.</p>","order":"2","image":"https://cdn.macbro.uz/macbro/1feec1cd-71f4-434f-9fc8-2b1d4a485cb8","children":null,"created_at":"Fri Sep 03 2021 13:27:40 GMT+0000 (Coordinated Universal Time)","updated_at":"Fri Sep 03 2021 13:27:40 GMT+0000 (Coordinated Universal Time)"},{"id":"61dea550fb7ad4001955c7c2","name":"Others","slug":"others-262pkybd90g4","active":true,"description":"","order":"12","image":"https://cdn.macbro.uz/macbro/f58f5785-165e-424f-a8f4-5d8ddfc2db94","children":null,"created_at":"Wed Jan 12 2022 09:54:24 GMT+0000 (Coordinated Universal Time)","updated_at":"Wed Jan 12 2022 09:54:24 GMT+0000 (Coordinated Universal Time)"}],"image":"https://cdn.macbro.uz/macbro/5e88e0d4-5802-4897-9c36-130367a5630d","wide":false},{"id":"60a4cdb03a0a1100194f542f","name":"Xiaomi","slug":"xiaomi","active":true,"description":"<p>Интернет-магазин MacBro представляет лучшую продукцию Xiaomi в Ташкенте. Мы не первый год специализируемся на поставках продукции от одного из лидеров мировой индустрии цифровых технологий. На сайте для покупателей созданы оптимальные условия продажи, включая минимальные по Узбекистану цены на смартфоны Сяоми и другие товары от крупнейшей китайской корпорации. Ознакомьтесь с ассортиментом, представленным в этой рубрике нашего каталога, и преимуществами предложения приобрести лучшую продукцию Samsung в интернет-магазине MacBro. Здесь же даны ответы на часто задаваемые вопросы покупателей.</p>","order":"10","children":[{"id":"60a4c7ad3a0a1100194f5426","name":"Redmi Note Series","slug":"redmi-note-series","active":true,"description":"<p>Интернет-магазин MacBro предлагает купить смартфоны Xiaomi Redmi Note в Ташкенте. Мы давно специализируемся на поставках лучших моделей популярной бюджетной серии, представленной крупнейшим китайским брендом мобильных гаджетов. На сайте созданы оптимальные условия продажи, включая минимальные по Узбекистану цены телефонов Редми Ноут. Ознакомьтесь с преимуществами предложения приобрести Xiaomi Redmi Note Series в интернет-магазине MacBro. Здесь же вы найдете ответы на часто задаваемые вопросы покупателей.</p>","order":"7","image":"https://cdn.macbro.uz/macbro/4d6b8f70-79b4-4dd9-a306-e1659cfd0a02","children":null,"created_at":"Wed May 19 2021 08:09:17 GMT+0000 (Coordinated Universal Time)","updated_at":"Wed May 19 2021 08:09:17 GMT+0000 (Coordinated Universal Time)"},{"id":"60a4cde93a0a1100194f5432","name":"Redmi Series","slug":"redmi-series","active":true,"description":"<p>Интернет-магазин MacBro предлагает купить смартфоны Xiaomi Redmi в Ташкенте. Мы не первый год специализируемся на поставках лучших моделей популярной бюджетной серии, представленной крупнейшей китайской корпорацией. На сайте созданы оптимальные условия продажи, включая минимальные по Узбекистану цены телефонов Редми. Ознакомьтесь с преимуществами предложения приобрести Xiaomi Redmi в интернет-магазине MacBro. Здесь же вы найдете ответы на часто задаваемые вопросы покупателей.</p>","order":"0","image":"https://cdn.macbro.uz/macbro/a1781283-c2ef-4e95-b410-d45867e4119f","children":null,"created_at":"Wed May 19 2021 08:35:53 GMT+0000 (Coordinated Universal Time)","updated_at":"Wed May 19 2021 08:35:53 GMT+0000 (Coordinated Universal Time)"},{"id":"60f015c8bd45890018fd4628","name":"Watches","slug":"watch","active":true,"description":"<p>Интернет-магазин MacBro предлагает заказать умные браслеты и часы Xiaomi в Ташкенте. Мы специализируемся на поставках этих гаджетов с момента их появления. На сайте созданы оптимальные условия продажи, включая минимальные по Узбекистану цены на смарт-часы Ксиоми (бренд Amazfit) и браслеты от китайской корпорации (бренд HuaMi). Ознакомьтесь с преимуществами предложения приобрести Xiaomi Watch в интернет-магазине MacBro. Здесь же вы найдете ответы на часто задаваемые вопросы покупателей.</p>","order":"8","image":"https://cdn.macbro.uz/macbro/7e33d1c4-bae9-43fa-b1a3-172460f1d145","children":null,"created_at":"Thu Jul 15 2021 11:02:32 GMT+0000 (Coordinated Universal Time)","updated_at":"Thu Jul 15 2021 11:02:32 GMT+0000 (Coordinated Universal Time)"},{"id":"60f01ad1bd45890018fd462b","name":"EarBuds","slug":"earbuds","active":true,"description":"<p>Интернет-магазин MacBro предлагает заказать наушники Xiaomi Mi True Wireless Earbuds в Ташкенте. Мы давно специализируемся на поставках этих гаджетов, представленных крупнейшим китайским производителем. На сайте созданы оптимальные условия продажи, включая минимальные по Узбекистану цены на беспроводные наушники Mi Earbuds. Ознакомьтесь с преимуществами предложения приобрести такие гаджеты в интернет-магазине MacBro. Здесь же вы найдете ответы на часто задаваемые вопросы покупателей.</p>","order":"9","image":"https://cdn.macbro.uz/macbro/51ef914c-2680-45e4-9285-394703c1e57f","children":null,"created_at":"Thu Jul 15 2021 11:24:01 GMT+0000 (Coordinated Universal Time)","updated_at":"Thu Jul 15 2021 11:24:01 GMT+0000 (Coordinated Universal Time)"},{"id":"6133702dbb15a6001b82c05c","name":"Others","slug":"others-di7hw7rkt5szwqn","active":true,"description":"","order":"10","image":"https://cdn.macbro.uz/macbro/0449eb75-b0e2-46a3-9b9c-fdc3668dbd92","children":null,"created_at":"Sat Sep 04 2021 13:10:05 GMT+0000 (Coordinated Universal Time)","updated_at":"Sat Sep 04 2021 13:10:05 GMT+0000 (Coordinated Universal Time)"}],"image":"https://cdn.macbro.uz/macbro/95add13c-762f-40df-8fb6-c2313c22f08a","wide":false},{"id":"622b205b66b18c001a598d77","name":"Планшеты","slug":"planshety","active":true,"description":"<p>Ищете где купить планшет в Ташкенте? Хотите приобрести последнюю модель планшетного компьютера от известного бренда? Желаете заказать планшет с доставкой по Узбекистану? MacBro &mdash; оптимальный выбор для решения этих и многих других задач. Мы не первый год специализируемся на продаже планшетов от ведущих зарубежных производителей. Нашим покупателям предлагаются оптимальные условия продажи. Разнообразный ассортимент, быстрая и надежная доставка, разные способы оплаты, рассрочка &mdash; все это дополняют доступные для Узбекистана цены на планшеты и акции, позволяющие экономить на покупках.</p>","order":"11","children":null,"image":"","wide":false},{"id":"622b20f066b18c001a598de9","name":"Наушники","slug":"naushniki","active":true,"description":"<p>Ищете хорошие недорогие наушники в Ташкенте? Хотите приобрести брендовые беспроводные наушники с доставкой по Узбекистану? Интернет-магазин MacBro поможет легко справиться с этими и подобными им задачами. Мы не первый год занимаемся поставками такой аудиотехники от Bose, JBL, Phillips и других популярных брендов. Качество от ведущих производителей сочетается с выгодными условиями продажи. Широкий выбор, оперативная доставка, надежные способы оплаты, рассрочка, доступные для покупателей в Ташкенте цены на наушники &mdash; только несколько преимуществ нашего предложения.</p>","order":"11","children":null,"image":"","wide":false},{"id":"61406fe3556ce1001ca4c1d4","name":"Подержанные гаджеты","slug":"poderzhannye-gadzhety-4x5bb1sktjw6yj3","active":true,"description":"<p>Интернет-магазин MacBro предлагает с максимальной для вас выгодой купить подержанные гаджеты в Ташкенте. Мы давно специализируемся на продаже такой техники от крупнейших производителей планеты. Смартфоны, ноутбуки и другая б/у электроника пользуются повышенным спросом среди наших покупателей. Хорошее качество и разнообразный выбор представленной в этом разделе нашего каталога продукции сочетаются с оптимальными условиями продажи, включающими минимальные по Узбекистану цены на подержанные гаджеты и оперативную доставку по всей территории страны.</p>","order":"12","children":null,"image":"","wide":false},{"id":"623095403ad103001b42e4fc","name":"Ноутбуки","slug":"noutbuki","active":true,"description":"<p>Ищете где заказать новый ноутбук в Ташкенте? Хотите приобрести оптовую партию товара для своего магазина ноутбуков? Желаете заказать нэтбук или ультрабук с доставкой по Узбекистану? Интернет-магазин MacBro &mdash; лучшее решение этих и многих других задач. Мы давно специализируемся на продаже ноутбуков от ведущих производителей. Нашим покупателям предлагаются оптимальные условия продажи. Разнообразный ассортимент, разные способы оплаты, быстрая и надежная доставка, покупки в рассрочку &mdash; все это дополняют доступные для Узбекистана цены на ноутбуки и акции, позволяющие клиентам сокращать затраты.</p>","order":"12","children":null,"image":"","wide":false},{"id":"619b92bbd6cce1001a309278","name":"Кнопочные телефоны","slug":"knopochnye-telefony-1ld77aqkwao6kbb","active":true,"description":"<p>Ищете где купить кнопочные телефоны в Ташкенте? Хотите приобрести оптом современные кнопочные телефоны для собственного магазина? Желаете заказать телефон с кнопками с доставкой по Узбекистану? Интернет-магазин MacBro станет оптимальным решением этих и многих других задач. Мы давно специализируемся на поставках простых телефонов от Philips, Nokia и других ведущих производителей. Нашим покупателям предлагаются оптимальные условия продажи. Большой выбор, разные способы оплаты, быстрая доставка, возможность покупки в рассрочку &mdash; все это дополняют доступные для Узбекистана цены на кнопочные телефоны и акции, позволяющие клиентам сокращать затраты.</p>","order":"30","children":[{"id":"619b92ded6cce1001a309285","name":"Кнопочные телефоны","slug":"knopochnye-telefony-1ld77aqkwao7bcf","active":true,"description":"","order":"30","image":"https://cdn.macbro.uz/macbro/3f4862cf-4a6f-47d0-bc13-50ab90bf6908","children":null,"created_at":"Mon Nov 22 2021 12:53:50 GMT+0000 (Coordinated Universal Time)","updated_at":"Mon Nov 22 2021 12:53:50 GMT+0000 (Coordinated Universal Time)"}],"image":"https://cdn.macbro.uz/macbro/77e6cdb5-1169-4c39-96bc-d8231c9fc8d9","wide":false}]
/// count : "10"

ProductCategoriesModel productCategoriesModelFromJson(String str) => ProductCategoriesModel.fromJson(json.decode(str));
String productCategoriesModelToJson(ProductCategoriesModel data) => json.encode(data.toJson());
class ProductCategoriesModel {
  ProductCategoriesModel({
      List<Categories>? categories, 
      String? count,}){
    _categories = categories;
    _count = count;
}

  ProductCategoriesModel.fromJson(dynamic json) {
    if (json['categories'] != null) {
      _categories = [];
      json['categories'].forEach((v) {
        _categories?.add(Categories.fromJson(v));
      });
    }
    _count = json['count'];
  }
  List<Categories>? _categories;
  String? _count;
ProductCategoriesModel copyWith({  List<Categories>? categories,
  String? count,
}) => ProductCategoriesModel(  categories: categories ?? _categories,
  count: count ?? _count,
);
  List<Categories>? get categories => _categories;
  String? get count => _count;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    if (_categories != null) {
      map['categories'] = _categories?.map((v) => v.toJson()).toList();
    }
    map['count'] = _count;
    return map;
  }

}

/// id : "607d6bdcb1bc9f0019489d32"
/// name : "Apple"
/// slug : "apple"
/// active : true
/// description : "<p>Testing it</p>"
/// order : "1"
/// children : [{"id":"6020fe60c988660019adfa22","name":"Mac","slug":"macbook","active":true,"description":"<p>Интернет-магазин MacBro предлагает купить ноутбуки MacBook в Ташкенте. Компания специализируется на поставках этой электроники уже более 12 лет. Мы являемся дистрибьютором Apple в Узбекистане, что позволяет обеспечить оптимальные условия продажи популярных ноутбуков от ведущего американского производителя. Ознакомьтесь с информацией о продукции, представленной в этой рубрике каталога, и преимуществами продажи лэптопов Макбук в Узбекистане в интернет-магазине MacBro. Также в обзоре даны ответы на часто задаваемые вопросы покупателей.</p>","order":"1","image":"https://cdn.macbro.uz/macbro/e6e0bf9d-37ee-4d9b-8c7f-32a48a236672","children":null,"created_at":"Mon Feb 08 2021 09:03:28 GMT+0000 (Coordinated Universal Time)","updated_at":"Mon Feb 08 2021 09:03:28 GMT+0000 (Coordinated Universal Time)"},{"id":"6020feadc988660019adfa25","name":"AirPods","slug":"airpods","active":true,"description":"<p>Интернет-магазин MacBro предлагает на выгодных для вас условиях купить наушники AirPods в Ташкенте. Компания уже более 12 лет специализируется на поставках мобильных гаджетов. При этом мы являемся дистрибьютором Apple в Узбекистане, что позволяет обеспечить оптимальные условия продажи лучших беспроводных наушников Аирподс в Узбекистане. Ознакомьтесь с информацией о продукции, представленной в этой рубрике нашего каталога, и преимуществами продажи Bluetooth-наушников Apple в онлайн-магазине MacBro. Также в обзоре даны ответы на часто задаваемые вопросы покупателей.</p>","order":"5","image":"https://cdn.macbro.uz/macbro/ccc67903-fb46-49bf-88d9-541979b073f7","children":null,"created_at":"Mon Feb 08 2021 09:04:45 GMT+0000 (Coordinated Universal Time)","updated_at":"Mon Feb 08 2021 09:04:45 GMT+0000 (Coordinated Universal Time)"},{"id":"6020fec7c988660019adfa28","name":"Watch","slug":"apple-watch","active":true,"description":"<p>Интернет-магазин MacBro предлагает заказать Apple Watch в Ташкенте. Компания давно специализируется на поставках этих набирающих популярность гаджетов. Мы являемся дистрибьютором Apple в Узбекистане, что позволяет обеспечить оптимальные условия продажи популярных смарт-часов от ведущего американского производителя. Ознакомьтесь с информацией о продукции, представленной в этой рубрике каталога, и преимуществами продажи умных часов Apple Watch в Узбекистане в интернет-магазине MacBro. Также в обзоре даны ответы на часто задаваемые вопросы покупателей.</p>","order":"4","image":"https://cdn.macbro.uz/macbro/fc194078-c2c4-4681-9879-a0f307ddfc91","children":null,"created_at":"Mon Feb 08 2021 09:05:11 GMT+0000 (Coordinated Universal Time)","updated_at":"Mon Feb 08 2021 09:05:11 GMT+0000 (Coordinated Universal Time)"},{"id":"6021089dc988660019adfa31","name":"iPhone","slug":"iphone","active":true,"description":"<p>Интернет-магазин MacBro предлагает купить iPhone в Ташкенте. Компания давно специализируется на поставках смартфонов от ведущего американского производителя. Мы являемся дистрибьютором Apple в Узбекистане, что позволяет обеспечить оптимальные условия продажи самой популярной марки телефонов. Ознакомьтесь с информацией о продукции, представленной в этой рубрике каталога, и преимуществами продажи Айфонов в Узбекистане в интернет-магазине MacBro. Также в обзоре даны ответы на часто задаваемые вопросы покупателей.</p>","order":"2","image":"https://cdn.macbro.uz/macbro/810d02c7-2265-4e27-9086-07cdc4ae1837","children":null,"created_at":"Mon Feb 08 2021 09:47:09 GMT+0000 (Coordinated Universal Time)","updated_at":"Mon Feb 08 2021 09:47:09 GMT+0000 (Coordinated Universal Time)"},{"id":"6039f8177aeef500184216b2","name":"iPad","slug":"ipad","active":true,"description":"<p>Интернет-магазин MacBro представляет категорию планшетов iPad в Ташкенте. Компания уже более 12 лет специализируется на поставках мобильных гаджетов от ведущего американского производителя. Мы являемся дистрибьютором Apple в Узбекистане, что позволяет обеспечить оптимальные условия продажи лучших моделей популярного планшета. Ознакомьтесь с информацией о продукции, представленной в этой рубрике каталога, и преимуществами продажи iPad Apple в Узбекистане в интернет-магазине MacBro. Также в обзоре даны ответы на часто задаваемые вопросы покупателей.</p>","order":"3","image":"https://cdn.macbro.uz/macbro/c351bd12-eeff-4df5-843b-74a429551136","children":null,"created_at":"Sat Feb 27 2021 07:43:19 GMT+0000 (Coordinated Universal Time)","updated_at":"Sat Feb 27 2021 07:43:19 GMT+0000 (Coordinated Universal Time)"}]
/// image : "https://cdn.macbro.uz/macbro/3045dc67-9604-4308-b1ba-70a09dc3519a"
/// wide : true

Categories categoriesFromJson(String str) => Categories.fromJson(json.decode(str));
String categoriesToJson(Categories data) => json.encode(data.toJson());
class Categories {
  Categories({
      String? id, 
      String? name, 
      String? slug, 
      bool? active, 
      String? description, 
      String? order, 
      List<Children>? children, 
      String? image, 
      bool? wide,}){
    _id = id;
    _name = name;
    _slug = slug;
    _active = active;
    _description = description;
    _order = order;
    _children = children;
    _image = image;
    _wide = wide;
}

  Categories.fromJson(dynamic json) {
    _id = json['id'];
    _name = json['name'];
    _slug = json['slug'];
    _active = json['active'];
    _description = json['description'];
    _order = json['order'];
    if (json['children'] != null) {
      _children = [];
      json['children'].forEach((v) {
        _children?.add(Children.fromJson(v));
      });
    }
    _image = json['image'];
    _wide = json['wide'];
  }
  String? _id;
  String? _name;
  String? _slug;
  bool? _active;
  String? _description;
  String? _order;
  List<Children>? _children;
  String? _image;
  bool? _wide;
Categories copyWith({  String? id,
  String? name,
  String? slug,
  bool? active,
  String? description,
  String? order,
  List<Children>? children,
  String? image,
  bool? wide,
}) => Categories(  id: id ?? _id,
  name: name ?? _name,
  slug: slug ?? _slug,
  active: active ?? _active,
  description: description ?? _description,
  order: order ?? _order,
  children: children ?? _children,
  image: image ?? _image,
  wide: wide ?? _wide,
);
  String? get id => _id;
  String? get name => _name;
  String? get slug => _slug;
  bool? get active => _active;
  String? get description => _description;
  String? get order => _order;
  List<Children>? get children => _children;
  String? get image => _image;
  bool? get wide => _wide;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    map['id'] = _id;
    map['name'] = _name;
    map['slug'] = _slug;
    map['active'] = _active;
    map['description'] = _description;
    map['order'] = _order;
    if (_children != null) {
      map['children'] = _children?.map((v) => v.toJson()).toList();
    }
    map['image'] = _image;
    map['wide'] = _wide;
    return map;
  }

}

/// id : "6020fe60c988660019adfa22"
/// name : "Mac"
/// slug : "macbook"
/// active : true
/// description : "<p>Интернет-магазин MacBro предлагает купить ноутбуки MacBook в Ташкенте. Компания специализируется на поставках этой электроники уже более 12 лет. Мы являемся дистрибьютором Apple в Узбекистане, что позволяет обеспечить оптимальные условия продажи популярных ноутбуков от ведущего американского производителя. Ознакомьтесь с информацией о продукции, представленной в этой рубрике каталога, и преимуществами продажи лэптопов Макбук в Узбекистане в интернет-магазине MacBro. Также в обзоре даны ответы на часто задаваемые вопросы покупателей.</p>"
/// order : "1"
/// image : "https://cdn.macbro.uz/macbro/e6e0bf9d-37ee-4d9b-8c7f-32a48a236672"
/// children : null
/// created_at : "Mon Feb 08 2021 09:03:28 GMT+0000 (Coordinated Universal Time)"
/// updated_at : "Mon Feb 08 2021 09:03:28 GMT+0000 (Coordinated Universal Time)"

Children childrenFromJson(String str) => Children.fromJson(json.decode(str));
String childrenToJson(Children data) => json.encode(data.toJson());
class Children {
  Children({
      String? id, 
      String? name, 
      String? slug, 
      bool? active, 
      String? description, 
      String? order, 
      String? image, 
      dynamic children, 
      String? createdAt, 
      String? updatedAt,}){
    _id = id;
    _name = name;
    _slug = slug;
    _active = active;
    _description = description;
    _order = order;
    _image = image;
    _children = children;
    _createdAt = createdAt;
    _updatedAt = updatedAt;
}

  Children.fromJson(dynamic json) {
    _id = json['id'];
    _name = json['name'];
    _slug = json['slug'];
    _active = json['active'];
    _description = json['description'];
    _order = json['order'];
    _image = json['image'];
    _children = json['children'];
    _createdAt = json['created_at'];
    _updatedAt = json['updated_at'];
  }
  String? _id;
  String? _name;
  String? _slug;
  bool? _active;
  String? _description;
  String? _order;
  String? _image;
  dynamic _children;
  String? _createdAt;
  String? _updatedAt;
Children copyWith({  String? id,
  String? name,
  String? slug,
  bool? active,
  String? description,
  String? order,
  String? image,
  dynamic children,
  String? createdAt,
  String? updatedAt,
}) => Children(  id: id ?? _id,
  name: name ?? _name,
  slug: slug ?? _slug,
  active: active ?? _active,
  description: description ?? _description,
  order: order ?? _order,
  image: image ?? _image,
  children: children ?? _children,
  createdAt: createdAt ?? _createdAt,
  updatedAt: updatedAt ?? _updatedAt,
);
  String? get id => _id;
  String? get name => _name;
  String? get slug => _slug;
  bool? get active => _active;
  String? get description => _description;
  String? get order => _order;
  String? get image => _image;
  dynamic get children => _children;
  String? get createdAt => _createdAt;
  String? get updatedAt => _updatedAt;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    map['id'] = _id;
    map['name'] = _name;
    map['slug'] = _slug;
    map['active'] = _active;
    map['description'] = _description;
    map['order'] = _order;
    map['image'] = _image;
    map['children'] = _children;
    map['created_at'] = _createdAt;
    map['updated_at'] = _updatedAt;
    return map;
  }

}